from aiogram import Router, types, F
from aiogram.utils.keyboard import InlineKeyboardBuilder
from analytics import log_event

router = Router()


@router.callback_query(F.data == "chapter_06")
async def chapter_06_handler(callback: types.CallbackQuery):
    # Логирование нажатия кнопки
    log_event(
        user_id=callback.from_user.id,
        username=callback.from_user.username or "",
        action_type="button_click",
        action_name="chapter_06",
        additional_data=""
    )
    
    builder = InlineKeyboardBuilder()
    builder.button(
        text="🫶Восстановить спокойствие и опору",
        callback_data="chapter_10"
    )

    text = (
        "<b>Когда всё на тебе - даже то, что не твоё, внутри рано или поздно ломается.</b>\n\n"
        "Ты не одна.\n"
        "Многие сильные женщины оказываются в этом состоянии - когда вроде всё под контролем, но внутри будто пусто и тревожно.\n"
        "Ты тащишь - потому что больше некому. Но тело и душа шепчут: «Хочу просто немного покоя».\n"
        "Это не слабость. Это сигнал: тебе пора вернуть опору на себя.\n\n"
        "«Оля пришла с ощущением, что держит весь мир: дети, работа, родители, кредиты.\n"
        "Говорила: “Если я остановлюсь - всё развалится.”\n"
        "Мы начали с малого - признать, что ей тяжело.\n"
        "Потом - разрешить себе хотя бы 10 минут ничего не делать без чувства вины.\n"
        "Через пару недель она сказала: “Я впервые за долгое время проснулась без тревоги. Просто тихо. Просто спокойно.”»\n\n"
        "<b>Я сделал гайд «Как восстановить спокойствие и внутреннюю опору, когда устала всё держать на себе».\n"
        "Там простые шаги и короткие практики, которые помогут снизить тревогу, выдохнуть и начать восстанавливаться - без надрыва и самокопания.\n"
        "Начни с малого — почувствуй, как возвращается дыхание и покой.</b>"
    )

    await callback.message.answer(text, reply_markup=builder.as_markup())
    await callback.answer()
